In [1]:
# Import the Zip file
path_to_zip_file = "datasets-1.zip"
directory_to_extract_to = ""

import zipfile
zip_ref = zipfile.ZipFile(path_to_zip_file, 'r')
zip_ref.extractall(directory_to_extract_to)
zip_ref.close()

In [2]:
# Load the csv data
import pandas as pd
Location = "datasets/axisdata.csv"
df = pd.read_csv(Location)

In [3]:
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [4]:
# Average cars sold per month
df['Cars Sold'].mean()

3.9229229229229228

In [5]:
# Max Cars sold per month
df['Cars Sold'].max()

7

In [6]:
# Min cars sold per month
df['Cars Sold'].min()

1

In [7]:
# Average Cars sold per month by gender
pd.pivot_table(df, index = ['Gender'], values = ['Cars Sold'])

        Cars Sold
Gender
F        3.760736
M        4.078431

In [8]:
# Average hours worked by people selling > 3 Cars per month
high_sellers = df[df['Cars Sold'] > 3]
high_sellers['Hours Worked'].mean()

34.740237691001695

In [9]:
# Average years of experience
df['Years Experience'].mean()

3.026026026026026

In [10]:
# Average years of experience for salesmen selling > 3 cars
high_sellers = df[df['Cars Sold'] > 3]
high_sellers['Years Experience'].mean()

3.0492359932088284

In [11]:
# Average cars sold per month based on training
pd.pivot_table(df, values = ['Cars Sold'], index = ['SalesTraining'])

               Cars Sold
SalesTraining
N               3.573850
Y               4.168942

In [12]:
# What do you think the best indicator for a good salesperson
#Training seems to be a strong indicator in addition to hours worked.

In [13]:
# Correlation 
df.corr()

                  Hours Worked  Years Experience  Cars Sold
Hours Worked          1.000000          0.028400   0.251038
Years Experience      0.028400          1.000000   0.062577
Cars Sold             0.251038          0.062577   1.000000

In [14]:
# Change the Column names
headers = list(df.columns.values)
headers[3] = 'Hours'
headers[5] = 'Years_Experienced'
headers[6] = 'Cars_Sold'
df.columns = headers
df.head()

,Fname,Lname,Gender,Hours,SalesTraining,Years_Experienced,Cars_Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [15]:
# Make Sales Training into a numeric value
def training(x):
    if x == "Y":
        return 1
    if x == "N":
        return 0

In [16]:
# Change the 'SalesTraining' Column
df['SalesTraining'] = df['SalesTraining'].apply(training)
df.tail()

,Fname,Lname,Gender,Hours,SalesTraining,Years_Experienced,Cars_Sold
994,Victor,Kane,M,22,1,5,4
995,Charles,Turner,M,45,0,1,4
996,August,Franklin,F,34,1,4,3
997,Victoria,Rogers,F,29,0,5,1
998,Mike,Gerardo,M,20,0,3,3

In [17]:
def gender(x):
    if x == "F":
        return 1
    if x == "M":
        return 0

In [18]:
# Change the 'Gender' Column
df['Gender'] = df['Gender'].apply(gender)
df.tail()

,Fname,Lname,Gender,Hours,SalesTraining,Years_Experienced,Cars_Sold
994,Victor,Kane,0,22,1,5,4
995,Charles,Turner,0,45,0,1,4
996,August,Franklin,1,34,1,4,3
997,Victoria,Rogers,1,29,0,5,1
998,Mike,Gerardo,0,20,0,3,3

In [19]:
df.corr()

,Gender,Hours,SalesTraining,Years_Experienced,Cars_Sold
Gender,1.000000,-0.004107,-0.040016,0.016194,-0.104055
Hours,-0.004107,1.000000,0.025857,0.028400,0.251038
SalesTraining,-0.040016,0.025857,1.000000,-0.017864,0.192009
Years_Experienced,0.016194,0.028400,-0.017864,1.000000,0.062577
Cars_Sold,-0.104055,0.251038,0.192009,0.062577,1.000000

In [20]:
import statsmodels.formula.api as sm
result = sm.ols(formula = 'Cars_Sold ~ Hours + Years_Experienced + SalesTraining - 1', data = df).fit()
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:              Cars_Sold   R-squared:                       0.873
Model:                            OLS   Adj. R-squared:                  0.873
Method:                 Least Squares   F-statistic:                     2292.
Date:                Mon, 26 Jun 2017   Prob (F-statistic):               0.00
Time:                        18:27:12   Log-Likelihood:                -1820.8
No. Observations:                 999   AIC:                             3648.
Df Residuals:                     996   BIC:                             3662.
Df Model:                           3
Covariance Type:            nonrobust
=====================================================================================
                        coef    std err          t      P>|t|      [0.025      0.975]
-------------------------------------------------------------------------------------
Hours                 0.0843      0.003     26.217      0.000       0.078       0.091
Years_Experienced     0.1831      0.031      5.956      0.000       0.123       0.243
SalesTraining         0.7605      0.094      8.112      0.000       0.577       0.944
==============================================================================
Omnibus:                      413.170   Durbin-Watson:                   2.060
Prob(Omnibus):                  0.000   Jarque-Bera (JB):               52.029
Skew:                           0.012   Prob(JB):                     5.03e-12
Kurtosis:                       1.882   Cond. No.                         68.9
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [21]:
result2 = sm.ols(formula = 'Cars_Sold ~ Hours + SalesTraining - 1', data = df).fit()
result2.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:              Cars_Sold   R-squared:                       0.869
Model:                            OLS   Adj. R-squared:                  0.869
Method:                 Least Squares   F-statistic:                     3306.
Date:                Mon, 26 Jun 2017   Prob (F-statistic):               0.00
Time:                        18:27:12   Log-Likelihood:                -1838.3
No. Observations:                 999   AIC:                             3681.
Df Residuals:                     997   BIC:                             3690.
Df Model:                           2
Covariance Type:            nonrobust
=================================================================================
                    coef    std err          t      P>|t|      [0.025      0.975]
---------------------------------------------------------------------------------
Hours             0.0990      0.002     47.261      0.000       0.095       0.103
SalesTraining     0.8123      0.095      8.555      0.000       0.626       0.999
==============================================================================
Omnibus:                      276.283   Durbin-Watson:                   2.061
Prob(Omnibus):                  0.000   Jarque-Bera (JB):               45.777
Skew:                           0.004   Prob(JB):                     1.15e-10
Kurtosis:                       1.951   Cond. No.                         68.3
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""